import { Router } from "express";
const router = new Router();
import outerRingController from "../controller/outerRingController.js";

router.post("/", outerRingController.create);
router.get("/", outerRingController.getAll);

export default router;

{
  const swag = {
    name: "конический",
    title: "Конические подшипники РВЗ : Цена, характеристики, аналоги",
    h1: "Конические подшипники РВЗ",
    description:
      "Купить конические подшипники РВЗ напрямую от производителя! Высокое качество, широкий ассортимент конических подшипников, оптимальные цены и доставка по всей России. Закажите сейчас!",
    url: "konicheskiy",
  };
}

// c двумя бортами на наружном кольце
// без бортов на наружном кольце
// без наружного кольца
// наружные кольца обращены друг к другу разноименными торцами
// наружные кольца обращены друг к другу узкими торцами
// наружные кольца обращены друг к другу широкими торцами
// с безбортовым наружним кольцом
// с безбортовым наружным кольцом
// с бортами на наружном кольце
// с бортиками на внутреннем кольце
// с бортом на наружном кольце
// с выступающим наружным безбортовым кольцом
// с выступающим наружным кольцом
// с глухим наружным кольцом
// с двумя наружными кольцами
// с двухразломным наружным кольцом
// с наружным дистанционным кольцом
// с одним наружным кольцом
// с одним наружным штампованным кольцом
// с однобортовым внутренним и плоским упорным кольцом
// с однобортовым наружным кольцом
// с одноразломным наружным кольцом
// с отверстием для смазки на наружном кольце
// с отверстием на наружном кольце
// с отверстиями и канавкой для смазки на наружном кольце
// с плоскими упорными кольцами на наружном кольце
// с пружинами на наружном кольце
// с разломом наружного кольца в продольном направлении
// с разъемным внешним кольцом
// с разъемным наружным кольцом
// с упорным бортом на наружном кольце
// со скосом на наружном кольце
// со сферической наружной поверхностью наружного кольца
// со сферической посадочной поверхностью наружного кольца
// со съемным наружным кольцом
// сферической наружной поверхностью наружного кольца
